<?php

namespace SaderatPaymentGateway;

use Exception;

class SaderatPGException extends Exception
{
    public static $errors = [
        'soap' => [
            0 => 'خطا در برقراری ارتباط با بانک',
            1 => 'عدم تطبیق امضای دیجیتال دیتای ارسالی از طرف بانک',
            2 => 'خطا در بررسی امضای دیجیتال',
        ],
        'token' => [
            1 => 'وجود خطا در فرمت اطلاعات ارسالی',
            2 => 'عدم وجود پذیرنده و ترمینال مورد درخواست در سیستم',
            3 => 'رد درخواست به علت دریافت درخواست توسط آدرس آی‌پی نامعتبر',
            4 => 'پذیرنده مورد نظر امکان استفاده از سیستم را ندارد.',
            5 => 'برخورد با مشکل در انجام درخواست مورد نظر',
            6 => 'خطا در پردازش درخواست',
            7 => 'بروز خطا در تشخیص اصالت اطلاعات (امضای دیجیتالی نامعتبر است)',
            8 => 'شماره خرید ارائه شده توسط پذیرنده (CRN) تکراری است.',
            9 => 'سیستم در حال حاضر قادر به سرویس دهی نمی باشد.',
        ],
        'verify' => [
            '-1' => 'عدم تطبیق امضای دیجیتال دیتای ارسالی به بانک',
            '-2' => 'دسترسی غیر مجاز از ای پی غیر مجازی',
            '101' => 'این تراکنش قبلا تایید شده است.',
            '102' => 'تراکنش مورد نظر برگشت خورده است.',
            '103' => 'تایید انجام نشد.',
            '106' => 'پیامی از سوئیچ پرداخت دریافت نشد.',
            '107' => 'تراکنش درخواستی موجود نیست.',
            '111' => 'مشکل در ارتباط با سوئیچ',
            '112' => 'مقادیر ارسالی در درخواست معتبر نیستند.',
            '113' => 'خطای نامشخص',
            '200' => 'کاربر از انجام تراکنش منصرف شده است.',
        ],
        'input' => [
            1 => 'شماره ترمینال وارد شده معتبر نیست.(شماره ترمینال باید ۸ کاراکتر باشد)',
            2 => 'کد پذیرنده وارد شده معتبر نیست.(کد پذیرنده باید ۱۵ کاراکتر باشد)',
            3 => 'کلید عمومی وجود ندارد و  یا فرمت مناسبی ندارد.',
            4 => 'کلید خصوصی وجود ندارد و  یا فرمت مناسبی ندارد.',
            5 => 'فرمت آدرس صفحه برگشت معتبر نیست.',
            6 => 'مبلغ تراکنش معتبر نیست. (مبلغ تراکنش نباید کمتر از ۱۰۰۰ ریال باشد)',
            7 => 'شماره رسید معتبر نیست. (شماره رسید پذیرنده حداقل باید ۳ کاراکتر و حداکثر ۲۰ کاراکتر باشد)',
            8 => 'وارد کردن آدرس بازگشت ضروری است.',
        ]
    ];

    public function __construct($code, $level, $message = null)
    {
        $this->code = intval($code);
        $this->message = self::$errors[$level][$this->code].($message ? ' ('.$message.')' : '');

    }
}